Catalogs/ДействияВРабочемМестеРаботникаСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ДействияВРабочемМестеРаботникаСклада</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Доступно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяУказатьСотрудника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапОтображения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыОтображенияДействияВРабочемМестеСотрудникаСклада</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПояснениеДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ЭтапыОтображенияДействияВРабочемМестеСотрудникаСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ЭтапыОтображенияДействияВРабочемМестеСотрудникаСклада</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПослеСканированияШКЗаказаПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеСканированияШКСотрудника</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ДействияВРабочемМестеРаботникаСклада/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	ДанныеВыбора = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСправочника.Ссылка КАК Действие
	|ИЗ
	|	Справочник.ДействияВРабочемМестеРаботникаСклада КАК ДанныеСправочника
	|ГДЕ
	|	НЕ ДанныеСправочника.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеСправочника.РеквизитДопУпорядочивания";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		ДанныеВыбора.Добавить(Выборка.Статус);		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Процедура заполняет справочник по умолчанию
//
Процедура ЗаполнитьПоставляемыеДанные(НоваяБаза = Ложь) Экспорт
	
	// ПослеСканированияШКЗаказаПокупателя
	СпрОбъект = Справочники.ДействияВРабочемМестеРаботникаСклада.ОткрытьЗаказПокупателя.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 10;
	СпрОбъект.Доступно = Истина;
	СпрОбъект.ТребуетсяУказатьСотрудника = Ложь;
	СпрОбъект.ЭтапОтображения = Перечисления.ЭтапыОтображенияДействияВРабочемМестеСотрудникаСклада.ПослеСканированияШКЗаказаПокупателя;
	СпрОбъект.ПояснениеДействия = "Открывает форму документа";
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.ДействияВРабочемМестеРаботникаСклада.ПечатьЗаказПокупателя.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 20;
	СпрОбъект.Доступно = Истина;
	СпрОбъект.ТребуетсяУказатьСотрудника = Ложь;
	СпрОбъект.ЭтапОтображения = Перечисления.ЭтапыОтображенияДействияВРабочемМестеСотрудникаСклада.ПослеСканированияШКЗаказаПокупателя;
	СпрОбъект.ПояснениеДействия = "Формирует печатную форму документа (тип печатной формы определяется в настройках пользователя)";
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.ДействияВРабочемМестеРаботникаСклада.ОтгрузитьЗаказПокупателя.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 30;
	СпрОбъект.Доступно = Истина;
	СпрОбъект.ТребуетсяУказатьСотрудника = Ложь;
	СпрОбъект.ЭтапОтображения = Перечисления.ЭтапыОтображенияДействияВРабочемМестеСотрудникаСклада.ПослеСканированияШКЗаказаПокупателя;
	СпрОбъект.ПояснениеДействия = "Создает документ реализации по заказу и открывает его форму";
	СпрОбъект.Записать();
	
	// ПослеСканированияШКСотрудника
	СпрОбъект = Справочники.ДействияВРабочемМестеРаботникаСклада.ЗаказПокупателяСобранЧастично.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 40;
	СпрОбъект.Доступно = НЕ НоваяБаза;
	СпрОбъект.ТребуетсяУказатьСотрудника = Ложь;
	СпрОбъект.ЭтапОтображения = Перечисления.ЭтапыОтображенияДействияВРабочемМестеСотрудникаСклада.ПослеСканированияШКСотрудника;
	СпрОбъект.ПояснениеДействия = "Присваивает заказу статус сборки ""Собран частично""";
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.ДействияВРабочемМестеРаботникаСклада.ЗаказПокупателяСобранПолностью.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 50;
	СпрОбъект.Доступно = НЕ НоваяБаза;
	СпрОбъект.ТребуетсяУказатьСотрудника = Ложь;
	СпрОбъект.ЭтапОтображения = Перечисления.ЭтапыОтображенияДействияВРабочемМестеСотрудникаСклада.ПослеСканированияШКСотрудника;
	СпрОбъект.ПояснениеДействия = "Присваивает заказу статус сборки ""Собран полностью""";
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.ДействияВРабочемМестеРаботникаСклада.ЗаказПокупателяИзменитьСборщика.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 60;
	СпрОбъект.Доступно = НЕ НоваяБаза;
	СпрОбъект.ТребуетсяУказатьСотрудника = Ложь;
	СпрОбъект.ЭтапОтображения = Перечисления.ЭтапыОтображенияДействияВРабочемМестеСотрудникаСклада.ПослеСканированияШКСотрудника;
	СпрОбъект.ПояснениеДействия = "Изменяет сборщика в заказе покупателя";
	СпрОбъект.Записать();
	//nva+++
	СпрОбъект = Справочники.ДействияВРабочемМестеРаботникаСклада.ЗаказПокупателяИзменитьСборщика.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 65;
	СпрОбъект.Доступно = НЕ НоваяБаза;
	СпрОбъект.ТребуетсяУказатьСотрудника = ИСТИНА;
	СпрОбъект.ЭтапОтображения = Перечисления.ЭтапыОтображенияДействияВРабочемМестеСотрудникаСклада.ПослеСканированияШКЗаказаПокупателя;
	СпрОбъект.ПояснениеДействия = "Лрьавляет второго сборщика в заказе покупателя";
	СпрОбъект.Записать();
	//nva---
	СпрОбъект = Справочники.ДействияВРабочемМестеРаботникаСклада.ЗаказПокупателяСобранПолностьюОтгрузить.ПолучитьОбъект();
	СпрОбъект.РеквизитДопУпорядочивания = 70;
	СпрОбъект.Доступно = НЕ НоваяБаза;
	СпрОбъект.ТребуетсяУказатьСотрудника = Ложь;
	СпрОбъект.ЭтапОтображения = Перечисления.ЭтапыОтображенияДействияВРабочемМестеСотрудникаСклада.ПослеСканированияШКСотрудника;
	СпрОбъект.ПояснениеДействия = "Присваивает заказу статус сборки ""Собран полностью"", создает по заказу документ реализации и открывает его форму";
	СпрОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
